#Cписки

#1 Создать два списка
list1 = [1, 2, 3, 4, 5]
list2 = ["a", "b", "c", "d", "e"]

#2 Извлечь из первого списка второй элемент
print(list1[1])

#3 Изменить во втором списке последний элемент
list2[4] = "r"

#4 Соеденить оба списка, результат вывести на экран
list_sum = list1+list2
print(list_sum)

#5 Срез с соединенного списка
list_cut = list_sum[2:8]
print(list_cut)

#6 Добавить в список два новых элемента
list_cut = list_cut + ['add', [1, 2]]
print(list_cut)

#7 Вернуть элементы общие в двух списках
a = [1, 1, 2, 3, 5, 8, 9, 10, 11, 12, 13]
b = [1, 2, 3, 4, 5, 6 , 7, 8, 9, 10, 11, 12, 13]
ab_common = set(a).intersection(b)
print(ab_common)

#8 Оставить только уникальные значения
list_uniq = [1, 2, 3, 4, 3, 2, 5, 1, 4, 6, 7, 1, 8, 2, 3]
list_set = set(list_uniq)
print(list_set)