# Работа с переменными

# 1 присвойте значение 10, var_float - значение 8.4, var_str - "No"
var_int = 10
var_float = 8.4
var_str = "No"

# 2 в переменную var_int, увеличить в 3.5 раза
big_int = var_int * 3.5

# 3 уменьшить на единицу
var_float = var_float - 1

# 4 Разделить var_int на var_float, а
var_int / var_float  # тут я, возможно, не понял условие
big_int / var_float

# 5  Изменитm значение переменной var_str на "NoNoYesYesYes".
var_str = print(var_str * 2 + "Yes" * 3)

# 6  Вывести все значения всех переменных
print(var_int)
print(big_int)
print(var_float)
print(var_str)
